Revit 2022 API
AnalyticalModelColumn.TopExtension Property
 The top extension option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public StickElementExtension TopExtension { get; set; }
Visual Basic
Public Property TopExtension As StickElementExtension
	Get
	Set
Visual C++
public:
property StickElementExtension TopExtension {
	StickElementExtension get ();
	void set (StickElementExtension value);
}
Examples
CopyC#
/// <summary>
/// Change the top extension for the column to Reference Level
/// </summary>
public void ChangeColumnTopExtension(FamilyInstance column)
{
    AnalyticalModelColumn amc = column.GetAnalyticalModel() as AnalyticalModelColumn;
    if (amc != null)
    {
        using (Transaction tran = new Transaction(column.Document, "Change Top Extension"))
        {
            tran.Start();
            StickElementExtension orgTopExt = amc.TopExtension;
            StickElementExtension newTopExt = StickElementExtension.ReferenceLevel;
            amc.TopExtension = newTopExt;
            TaskDialog.Show("AnalyticalModelColumn", "AnalyticalModelColumn ID: " + amc.Id + "; \nOriginal TopExtension value was: " + orgTopExt + "; \nNew TopExtension value: " + newTopExt);
            tran.Commit();
        }
    }
}
CopyVB.NET
''' <summary>
''' Change the top extension for the column to Reference Level
''' </summary>
Public Sub ChangeColumnTopExtension(column As FamilyInstance)
   Dim amc As AnalyticalModelColumn = TryCast(column.GetAnalyticalModel(), AnalyticalModelColumn)
   If amc IsNot Nothing Then
      Using tran As New Transaction(column.Document, "Change Top Extension")
         tran.Start()
         Dim orgTopExt As StickElementExtension = amc.TopExtension
         Dim newTopExt As StickElementExtension = StickElementExtension.ReferenceLevel
         amc.TopExtension = newTopExt
         TaskDialog.Show("AnalyticalModelColumn", "AnalyticalModelColumn ID: " + amc.Id.ToString + "; " & vbLf & "Original TopExtension value was: " + orgTopExt + "; " & vbLf & "New TopExtension value: " + newTopExt)
         tran.Commit()
      End Using
   End If
End Sub
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModelColumn Class
Autodesk.Revit.DB.Structure Namespace